Revit 2024 API
IFCAnyHandle.Delete Method
 Deletes the handle.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public void Delete()
Visual Basic
Public Sub Delete
Visual C++
public:
void Delete()
See Also
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace